cowlove/esp32jimlib/src/jimlib.h
#ifndef INC_JIMLIB_H
#define INC_JIMLIB_H
#include <functional>
#include <string>
#include <string>
#include <sstream>
#include <vector>
#include <iterator>
#include <fcntl.h>
#ifndef CSIM
//#include "DNSServer.h"
#include <HardwareSerial.h>
#include <SPI.h>
#define FS_NO_GLOBALS
#include <FS.h>
#include "ArduinoOTA.h"
#include "WiFiUdp.h"
#include "Wire.h"
#include <OneWireNg.h>
#include <OneWireNg_CurrentPlatform.h>
#include <WiFiClientSecure.h>
#include <PubSubClient.h>

#include <utility>
#include <regex>

#ifdef ESP32
#include <soc/rtc_cntl_reg.h>
#include <soc/soc.h>
#include <Update.h>			
#include <HTTPClient.h>
//#include <WiFiMulti.h>
#include <ESPmDNS.h>
#include <Update.h>			
#include <WebServer.h>
#include <mySD.h> // Add "EXCLUDE_DIRS=esp32-micro-sdcard" to Makefile if this breaks ESP8266 builds
#include <SPIFFS.h>
#include <esp_task_wdt.h>
#else // ESP32
static inline void esp_task_wdt_reset() {}
static inline void esp_task_wdt_init(int, int) {}
static inline void esp_task_wdt_add(void *) {}
static inline void ledcSetup(int, int, int) {}
static inline void ledcAttachPin(int, int) {}
static inline void ledcWrite(int, int) {}
#endif //ESP32
#else // !CSIM
#include "ESP32sim_ubuntu.h"
#endif

#include <stdarg.h>
#define DEG2RAD(x) ((x)*M_PI/180)
#define RAD2DEG(x) ((x)*180/M_PI)

inline std::string strfmt(const char *format, ...) { 
    va_list args;
    va_start(args, format);
	char buf[256];
	vsnprintf(buf, sizeof(buf), format, args);
    va_end(args);
	return std::string(buf);
}

inline String Sfmt(const char *format, ...) { 
    va_list args;
    va_start(args, format);
	char buf[256];
	vsnprintf(buf, sizeof(buf), format, args);
    va_end(args);
	return String(buf);
}

inline std::string sfmt(const char *format, ...) { 
    va_list args;
    va_start(args, format);
	char buf[256];
	vsnprintf(buf, sizeof(buf), format, args);
    va_end(args);
	return std::string(buf);
}

inline int scanI2c() { 
	int count = 0;
	for (byte i = 8; i < 120; i++)
	{
			Wire.beginTransmission (i);          // Begin I2C transmission Address (i)
			if (Wire.endTransmission () == 0)  // Receive 0 = success (ACK response) 
			{
					Serial.print ("Found address: ");
					Serial.print (i, DEC);
					Serial.print (" (0x");
					Serial.print (i, HEX);     // PCF8574 7 bit address
					Serial.println (")");
					count++;
			}
	}
	Serial.print ("Found ");      
	Serial.print (count, DEC);        // numbers of devices
	Serial.println (" device(s).");

	return count;
}

inline void printPins() { 
        for (int n = 0; n <= 1; n++) {
                pinMode(n, INPUT_PULLUP); 
                Serial.printf("%02d:%d ", n, digitalRead(n));
        }
        for (int n = 2; n <= 5; n++) {
                pinMode(n, INPUT_PULLUP); 
                Serial.printf("%02d:%d ", n, digitalRead(n));
        }
        for (int n = 12; n <= 39; n++) { 
                pinMode(n, INPUT_PULLUP); 
                Serial.printf("%02d:%d ", n, digitalRead(n));
        }
        Serial.print("\n");
#ifdef ESP32
		esp_task_wdt_reset();
#endif
}

#ifdef ESP32
class FakeMutex {
	public:
	void lock() {}
	void unlock() {}
};

class FakeSemaphore { 
 public:
	FakeSemaphore(int max = 1, int init = 1) {}
	bool take(int delay = 0) { return true; } 
	void give() {}
};

class Mutex {
	SemaphoreHandle_t xSem;
 public:
	Mutex() { 
		xSem = xSemaphoreCreateCounting(1,1);
		unlock();
	}
	void lock() { xSemaphoreTake(xSem, portMAX_DELAY); } 
	void unlock() { xSemaphoreGive(xSem); }
};

class Semaphore { 
	SemaphoreHandle_t xSem;
 public:
	Semaphore(int max = 1, int init = 1) { 
		xSem = xSemaphoreCreateCounting(max, init);
	}
	bool take(int delay = portMAX_DELAY) { return xSemaphoreTake(xSem, delay); } 
	void give() { xSemaphoreGive(xSem); }
	int getCount() { return uxSemaphoreGetCount(xSem); } 
};

class ScopedMutex {
	Mutex *mutex; 
  public:
	ScopedMutex(Mutex &m) : mutex(&m) { mutex->lock(); } 
	ScopedMutex(FakeMutex &m) : mutex(NULL) {} 
	~ScopedMutex() { if (mutex != NULL) mutex->unlock(); } 
};
#endif


class LineBuffer {
public:
	char line[1024];
	char len = 0;
	int add(char c, std::function<void(const char *)> f = NULL) {
		int r = 0;
		if (c != '\r' && c != '\n')
			line[len++] = c; 
		if (len >= sizeof(line) - 1 || c == '\n') {
			r = len;
			line[len] = 0;
			len = 0;
			if (f != NULL) { 
				f(line);
			}
		}
		return r;
	}
	void add(const char *b, int n, std::function<void(const char *)> f) { 
		for (int i = 0; i < n; i++) {
			add(b[i], f); 
		}
	}
	void add(const uint8_t *b, int n, std::function<void(const char *)> f) { add((const char *)b, n, f); } 
};

class IntervalTimer {
public: 
	double last, interval;
	IntervalTimer(double i) : interval(i) {}
	bool tick(double now) {
		bool rval = (floor(now / interval) != floor(last / interval));
		last = now;
		return rval;
	}
};

class EggTimer {
	uint64_t last;
	uint64_t interval; 
	bool first = true;
	bool immediate = false;
public:
	EggTimer(float ms, bool imm = false) : interval(ms * 1000), last(0) { 
		reset(imm); 
	}
	bool tick() { 
		uint64_t now = micros();
		if (now - last >= interval || immediate == true) {
			immediate = false; 
			last += interval;
			// reset last to now if more than one full interval behind 
			if (now - last >= interval) 
				last = now;
			return true;
		} 
		return false;
	}
	void reset(bool imm = false) { 
		last = micros();
		immediate = imm;
	}
	void alarmNow() { 
		reset(true);
	}
};
typedef EggTimer Timer;

class DigitalDebounce {
	EggTimer timer;
	bool recentlyPressed;
	long startPress;
	int lastDuration;
	int lastVal;
public:
	int duration;
	int count;
	DigitalDebounce(int ms = 50) : timer(ms), recentlyPressed(false),count(0) {}
	bool checkOneshot(bool button) {
		bool rval = false; 
		if (button == true) {
			if (timer.tick() && lastVal == false) 
				recentlyPressed = false;
			rval = !recentlyPressed;
			if (rval) {
				count++;
				startPress = millis();
			}
			recentlyPressed = true;
			timer.reset();
			duration = max(1UL, millis() - startPress);
		} else {
			duration = 0;
			if (timer.tick()) 
				recentlyPressed = false;
		}
		lastVal = button;
		return rval;
	}
	int checkEndPress() {
		int rval = 0; 
		if (duration == 0 && lastDuration > 0) 
			rval = lastDuration;
		lastDuration = duration;
		return rval;
	}
};

#ifdef ESP32
class RotaryEncoder {
public:
	int pin1, pin3;
	DigitalDebounce a,b;
	int limMin, limMax;
	int value;
	bool wrap;
	int count = 0;
	unsigned long lastChange;

