cowlove/esp32jimlib/src/jimlib.h
/*
 * Server Index Page
 */
 
const char* serverIndex = 
"<script src='https://ajax.googleapis.com/ajax/libs/jquery/3.2.1/jquery.min.js'></script>"
"<form method='POST' action='#' enctype='multipart/form-data' id='upload_form'>"
   "<input type='file' name='update'>"
        "<input type='submit' value='Update'>"
    "</form>"
 "<div id='prg'>progress: 0%</div>"
 "<script>"
  "$('form').submit(function(e){"
  "e.preventDefault();"
  "var form = $('#upload_form')[0];"
  "var data = new FormData(form);"
  " $.ajax({"
  "url: '/update',"
  "type: 'POST',"
  "data: data,"
  "contentType: false,"
  "(process)Data:false,"
  "xhr: function() {"
  "var xhr = new window.XMLHttpRequest();"
  "xhr.upload.addEventListener('progress', function(evt) {"
  "if (evt.lengthComputable) {"
  "var per = evt.loaded / evt.total;"
  "$('#prg').html('progress: ' + Math.round(per*100) + '%');"
  "}"
  "}, false);"
  "return xhr;"
  "},"
  "success:function(d, s) {"
  "console.log('success!')" 
 "},"
 "error: function (a, b, c) {"
 "}"
 "});"
 "});"
 "</script>";
#endif

int spiffsInit = 0;

template<class T> 
class SPIFFSVariableESP32 { 
	String filename;
	const T def;
public:
	SPIFFSVariableESP32(const char *f, const T &d) : filename(f), def(d) {}
	operator const T() {
		T val = def;
		if (!spiffsInit) { 
			SPIFFS.begin();
		
			spiffsInit = 1;
		}
		fs::File file = SPIFFS.open(filename.c_str(), "r");
		if (file) { 
			uint8_t buf[64];
			int b = file.read(buf, sizeof(buf) - 1);
			//Serial.printf("read %d bytes from %s\n", b, filename.c_str());
			file.close();
			if (b > 0) {
				buf[b] = 0; 
				sscanf((char *)buf, "%d", &val);
			}
		}
		return val;
	} 
	SPIFFSVariableESP32 & operator=(const T&v) { 
		if (!spiffsInit) { 
			SPIFFS.begin();
			spiffsInit = 1;
		}	
		fs::File file = SPIFFS.open(filename.c_str(), "w");
		if (file) { 
			file.printf("%d\n", v);
			file.close();
			//Serial.printf("Wrote file %s\n", filename.c_str());
		} else { 
			//Serial.printf("error writing file %s\n", filename.c_str());
			SPIFFS.format();
		}
		return *this;
	}
};

// TODO: I think there is a ESP8266 alternative to the SPIFFS.h, find it 
template<class T> 
struct SPIFFSVariableFake { 
	const T def;
	SPIFFSVariableFake(const char *f, const T &d) : def(d) {}
	operator const T() { return def; } 
	SPIFFSVariableFake & operator=(const T&v) { return *this; }
};

#ifdef ESP32
#define SPIFFSVariable SPIFFSVariableESP32
#else
#define SPIFFSVariable SPIFFSVariableFake
#endif

class JimWiFi { 
	EggTimer report = EggTimer(1000);
	bool firstRun = true, firstConnect = true;
	std::function<void(void)> connectFunc = NULL;
	std::function<void(void)> otaFunc = NULL;
	// TODO: move this into JimWifi
	SPIFFSVariable<int> lastAP = SPIFFSVariable<int>("/lastap", -1);
	void autoConnect() {
		if (!enabled) 
			return;

			struct {
				const char *name;
				const char *pass;
			} aps[] = {	{"Ping-582B", ""}, 
						//{"ChloeNet", "niftyprairie7"},
						//{"Flora2", "Maynards."},
						{"MOF-Guest", ""},
						//{"XXX Bear Air Sport Aviation", "niftyprairie7"}, 
						{"ClemmyNet","clementine is a cat"},
						{"ChloeNet4", "niftyprairie7"},
						{"Tip of the Spear", "51a52b5354"},  
						{"Team America", "51a52b5354"},  
						{"Station 54", "Local1747"},
						{"TUK-FIRE", "FD priv n3t 20 q4"} };

		//WiFi.disconnect(true);
		//WiFi.mode(WIFI_STA);
		WiFi.setSleep(false);
		//delay(100);

		int bestMatch = lastAP;
		if (bestMatch >= 0 && bestMatch < (sizeof(aps)/sizeof(aps[0]))) { 
			Serial.printf("Trying cached WiFi AP '%s'...\n", aps[bestMatch].name);
			WiFi.begin(aps[bestMatch].name, aps[bestMatch].pass);
			for(int d = 0; d < 80; d++) { 
				if (WiFi.status() == WL_CONNECTED) {
					Serial.printf("Connected\n");
					return;
				}
				esp_task_wdt_reset();
				delay(100);
			}
		}
		bestMatch = -1;

		Serial.println("Scanning...");
		WiFi.disconnect(true);
		//WiFi.mode(WIFI_STA);
		WiFi.setSleep(false);
		//delay(1000);
		esp_task_wdt_reset();
		int n = WiFi.scanNetworks();
		esp_task_wdt_reset();
		Serial.println("scan done");
		
		if (n == 0) {
			Serial.println("no networks found");
		} else {
			Serial.printf("%d networks found\n", n);
			for (int i = 0; i < n; ++i) {
			// Print SSID and RSSI for each network found
			// TODO handle the trailing space in some AP names 
				Serial.printf("%3d: %s (%d)\n", i + 1, WiFi.SSID(i).c_str(), WiFi.RSSI(i));
				for (int j = 0; j < sizeof(aps)/sizeof(aps[0]); j++) { 				
					if (strcmp(WiFi.SSID(i).c_str(), aps[j].name) == 0) { 
						if (bestMatch == -1 || j < bestMatch) {
							bestMatch = j;
						}
					}
				}	
			}
		}
		if (bestMatch == -1) {
			bestMatch = 0;
		}
		WiFi.scanDelete();
		Serial.printf("Using WiFi AP '%s'...\n", aps[bestMatch].name);
		//WiFi.disconnect(true);
		//WiFi.mode(WIFI_STA);
		//WiFi.setSleep(false);
		delay(100);
		WiFi.begin(aps[bestMatch].name, aps[bestMatch].pass);
		for(int d = 0; d < 200; d++) { 
			if (WiFi.status() == WL_CONNECTED) {
				Serial.printf("Connected\n");
				lastAP = bestMatch;
				return;
			}
			delay(100);
			esp_task_wdt_reset();
		}
	}
public:
    bool updateInProgress = false;
	bool debug = false;
	bool enabled = true;
	WiFiUDP udp;
	//WiFiMulti wifi;
	EggTimer connCheck = EggTimer(30000);
	void onConnect(std::function<void(void)> oc) { 
		connectFunc = oc;
	}
	void onOTA(std::function<void(void)> oo) { 
		otaFunc = oo;
	}
	void invalidateCachedAP() { 
		lastAP = -1;
	}
	void run() {
		if (!enabled) 
			return;

		if (firstRun) {
			autoConnect();			
			firstRun = false;
		}
		if (firstConnect == false && connCheck.tick() && WiFi.status() != WL_CONNECTED) {
			WiFi.disconnect();
			WiFi.reconnect();
		}
		if (WiFi.status() == WL_CONNECTED) { 
			if (firstConnect ==  true) { 
				firstConnect = false;
#if  0
				server.on("/", HTTP_GET, []() {
				server.sendHeader("Connection", "close");
				server.send(200, "text/html", loginIndex);
				});
				server.on("/serverIndex", HTTP_GET, []() {
				server.sendHeader("Connection", "close");
				server.send(200, "text/html", serverIndex);
				});
				/*handling uploading firmware file */
				server.on("/update", HTTP_POST, []() {
				server.sendHeader("Connection", "close");
				server.send(200, "text/plain", (Update.hasError()) ? "FAIL" : "OK");
				ESP.restart();
				}, [this]() {
				HTTPUpload& upload = server.upload();
				esp_task_wdt_reset();

