cowlove/esp32jimlib/src/jimlib.h
				if (upload.status == UPLOAD_FILE_START) {
					if (this->otaFunc != NULL) { 
						this->otaFunc();
					}
					Serial.printf("Update: %s\n", upload.filename.c_str());
					if (!Update.begin(UPDATE_SIZE_UNKNOWN)) { //start with max available size
					Update.printError(Serial);
					}
				} else if (upload.status == UPLOAD_FILE_WRITE) {
					//Serial.printf("Update: write %d bytes\n", upload.currentSize);
					esp_task_wdt_reset();	
					/* flashing firmware to ESP*/
					if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
					Update.printError(Serial);
					}
					delay(10);
				} else if (upload.status == UPLOAD_FILE_END) {
					if (Update.end(true)) { //true to set the size to the current progress
					Serial.printf("Update Success: %u\nRebooting...\n", upload.totalSize);
					} else {
					Update.printError(Serial);
					}
				}
				});
				server.begin();
#endif

				ArduinoOTA.onStart([this]() {
					String type;
					if (this->otaFunc != NULL) { 
						this->otaFunc();
					}
					if (ArduinoOTA.getCommand() == U_FLASH) {
					type = "sketch";
					} else { // U_FS
					type = "filesystem";
					}
					#ifdef ESP32
					WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0); //disable brownout detector   
					#endif

					// NOTE: if updating FS this would be the place to unmount FS using FS.end()
					Serial.println("Start updating " + type);
					});
					ArduinoOTA.onEnd([]() {
					Serial.println("\nEnd");
				});
				ArduinoOTA.onProgress([&](unsigned int progress, unsigned int total) {
						//Serial.printf("Progress: %u%%\n", (progress / (total / 100)));
						esp_task_wdt_reset();
						updateInProgress = true;
						delay(30);
				});
				ArduinoOTA.onError([&](ota_error_t error) {
					Serial.printf("Error[%u]: ", error);
					if (error == OTA_AUTH_ERROR) {
					Serial.println("Auth Failed");
					} else if (error == OTA_BEGIN_ERROR) {
					Serial.println("Begin Failed");
					} else if (error == OTA_CONNECT_ERROR) {
					Serial.println("Connect Failed");
					} else if (error == OTA_RECEIVE_ERROR) {
					Serial.println("Receive Failed");
					} else if (error == OTA_END_ERROR) {
					Serial.println("End Failed");
					}
					updateInProgress = false;
				});
	
				
				ArduinoOTA.begin();

				udp.begin(9999);
				if (connectFunc != NULL) { 
					connectFunc();
				}
			}
		
				
			do {
				ArduinoOTA.handle();
			} while(updateInProgress == true);
//			server.handleClient();
			if (report.tick()) {
				udpDebug(""); 
			}
		}
	}
	bool connected() { return WiFi.status() == WL_CONNECTED;  }  
	void udpDebug(const char *s) { 
		if (!connected() || !debug)
			return;
		udp.beginPacket("255.255.255.255", 9000);
		char b[128];
		snprintf(b, sizeof(b), "%08d %s %s " __DATE__ "   " __TIME__ "   %s ", 
			(int)(millis() / 1000), WiFi.localIP().toString().c_str(), 
			basename_strip_ext(__BASE_FILE__).c_str(), getMacAddress().c_str());
		udp.write((const uint8_t *)b, strlen(b));
		udp.write((const uint8_t *)s, strlen(s));
		udp.write((const uint8_t *)"\n", 1);
		udp.endPacket();
	}
};

#ifdef CSIM
#include <fcntl.h>
#include <unistd.h>
#endif

#ifndef ESP32

class ShortBootDebugMode {
	SPIFFSVariable<int> shortBootCount = SPIFFSVariable<int>("/shortBootCount", 1);
	bool initialized = false;
	bool cleared = false;
	int sbCount; 
	int threshold;
  public:
	ShortBootDebugMode(int t) : threshold(t) {}
	void begin() {
		shortBootCount = shortBootCount + 1;
		sbCount = shortBootCount;
		
		Serial.printf("Short boot count %d\n", sbCount);
		initialized = true;
	}
	bool check() {
		if (initialized == false) { 
			begin();
		}
		if (millis() > 5000 && cleared == false) { 
			cleared = true;
			shortBootCount = 0 ;
		}
		return sbCount >= threshold;
	} 
};
#endif // ESP32

template<class T>
class ExtrapolationTable {
        bool between(T a, T b, T c) { 
                return (c >= a && c < b) || (c <= a && c > b);
        }
public:
        struct Pair {
             T a,b;        
        } *table;
        ExtrapolationTable(struct Pair *t) : table(t) {}
        T extrapolate(T in, bool reverse = false) {
                for(int index = 1; table[index].a != -1 || table[index].b != -1; index++) {     
                        if (!reverse && between(table[index - 1].a, table[index].a, in))  
                                return table[index - 1].b + (in - table[index - 1].a) 
                                        * (table[index].b - table[index - 1].b) 
                                        / (table[index].a - table[index - 1].a);
                        if (reverse && between(table[index - 1].b, table[index].b, in)) 
                                return table[index - 1].a + (in - table[index - 1].b) 
                                        * (table[index].a - table[index - 1].a) 
                                        / (table[index].b - table[index - 1].b);                
          
                }
                return -1;
        }
        T operator () (T in) { return extrapolate(in); }
};

static const float FEET_PER_METER = 3.28084;
static const float MPS_PER_KNOT = 0.51444;

inline float random01() { 	return rand() / (RAND_MAX + 1.0); }
#define ARRAY_SIZE(array) (sizeof(array)/sizeof(array[0]))
#ifndef GIT_VERSION
#define GIT_VERSION "unknown-git-version"
#endif

#ifdef GIT_VERSION
char _GIT_VERSION[] = GIT_VERSION;
#else
char _GIT_VERSION[] = "undefined";
#endif

static inline float avgAnalogRead(int pin, int avg = 1024) { 
	float bv = 0;
	for (int i = 0; i < avg; i++) {
		bv += analogRead(pin);
	}
	return bv / avg;
}

static inline void bin2hex(const char *in, int len, char *out, int olen) {
	len = min(len, olen / 2); 
	for (int n = 0; n < len; n++) { 
		sprintf(out + 2 * n, "%02x", in[n]);
	}
	out[2 * len] = '\0';
}

static inline int hex2bin(const char *in, char *out, int inLength) { 
        for (const char *p = in; p < in + inLength ; p += 2) { 
                char b[3];
                b[0] = p[0];
                b[1] = p[1];
                b[2] = 0;
                int c;
                sscanf(b, "%x", &c);
                *(out++) = c;
        }
        return inLength / 2;
}

void dbg(const char *(format), ...) { 
	va_list args;
	va_start(args, format);
	char buf[256];
	vsnprintf(buf, sizeof(buf), format, args);
	va_end(args);
	//mqtt.publish("debug", buf);
	Serial.println(buf);
}

