cowlove/esp32jimlib/src/jimlib.h
#ifdef ESP32 // TODO we could do this on the 8266
static void webUpgrade(const char *u) {
	//WiFiClientSecure wc;
	//wc.setInsecure();
	HTTPClient client; 

	int offset = 0;
	int len = 1024 * 16;
	int errors = 0;
	int fwLen = 0;
 
	Update.begin(UPDATE_SIZE_UNKNOWN);
	Serial.println("Updating firmware...");

	while(true) { 
		esp_task_wdt_reset();
		String url = String(u) + Sfmt("?len=%d&offset=%d", len, offset);
		dbg("offset %d, len %d, url %s", offset, len, url.c_str());
		//client.begin(wc, url);
		client.begin(url);
		int resp = client.GET();
		//dbg("HTTPClient.get() returned %d\n", resp);
		if(resp != 200) {
			dbg("Get failed\n");
			Serial.print(client.getString());
			delay(5000);
			if (++errors > 10) { 
				return;
			}
			continue;
		}
		int	totalLength = client.getSize();
		int len = totalLength;
		uint8_t bbuf[128], tbuf[256];
	
		//Serial.printf("FW Size: %u\n",totalLength);
		if (totalLength == 0) { 
			Serial.printf("\nUpdate Success, Total Size: %u\nRebooting...\n", fwLen);
			Update.end(true);
			ESP.restart();
			return;				
		}
				
		WiFiClient * stream = client.getStreamPtr();
		while(client.connected() && len > 0) {
			int avail = stream->available();
			avail = avail & 0xfffffe; // don't split 2-byte hex across buffers
			//dbg("Avail %d %d", stream->available(), avail);
			if(avail) {
				int c = stream->readBytes(tbuf, ((avail > sizeof(tbuf)) ? sizeof(tbuf) : avail));
				if (c > 0) {
					hex2bin((const char *)tbuf, (char *)bbuf, c);
					//if (c % 2 == 1) 
					//	dbg("Update with %d, avail %d", c, avail);
					Update.write(bbuf, c / 2);
					fwLen += c / 2;
					if(len > 0) {
						len -= c;
					}
				}
			}
			delay(1);
		}	
		client.end();
		offset += totalLength / 2;
	}
}
#endif

// create a String from a char buf without NULL termination 
String buf2str(const byte *buf, int len) { 
  String s;
  for (int i = 0; i < len; i++) {
	s += (char)buf[i];
  }
  return s;
}

// connects to an mqtt server, publish stuff on <name>, subscribe to <name>/in

class MQTTClient { 
	WiFiClient espClient;
	void callBack(char *topic, byte *p, unsigned int l) {
		if (userCallback != NULL) { 
			userCallback(String(topic), buf2str(p, l));
		}		
	}
	std::function<void(String,String)> userCallback = NULL;
public:
        String topicPrefix, server;
	bool active;
	PubSubClient client;
	void setCallback(std::function<void(String,String)> cb) { userCallback = cb; }
	MQTTClient(const char *s, const char *t, std::function<void(String,String)> cb = NULL, bool a = true) : 
		active(a), server(s), topicPrefix(t), client(espClient), userCallback(cb) {
	}
	void publish(const char *suffix, const char *m) { 
		String t = topicPrefix + "/" + suffix;
		client.publish(t.c_str(), m);
	}
	void publish(const char *suffix, const String &m) {
		 publish(suffix, m.c_str()); 
	}
	void pub(const char *m) { publish("out", m); } 
	void reconnect() {
	// Loop until we're reconnected
		if (active == false || WiFi.status() != WL_CONNECTED || client.connected()) 
			return;
		client.setServer(server.c_str(), 1883);
		Serial.println("MQTT connecting...");
		if (client.connect((topicPrefix + getMacAddress()).c_str())) {
			client.subscribe((topicPrefix + "/in").c_str());
			client.setCallback([this](char* topic, byte* p, unsigned int l) {
				this->callBack(topic, p, l);
			});
			std::string s = strfmt("MQTT connected uptime %.1f sec", millis() / 1000.0);
			publish("sys", s.c_str());
			Serial.println(s.c_str());
		} else {
			Serial.print("failed, rc=");
			Serial.print(client.state());
		}
	}
	void dprintf(const char *format, ...) { 
		va_list args;
		va_start(args, format);
        char buf[256];
        vsnprintf(buf, sizeof(buf), format, args);
	    va_end(args);
		client.publish((topicPrefix + "/debug").c_str(), buf);
	}
	void run() { 
		if (active) { 
			client.loop();
			reconnect();
		}
	}
};

#ifndef ESP32
#define PROGMEM
#endif

int getLedPin() { 
	const String mac = getMacAddress(); 
	if (mac == PROGMEM "349454C12BB0") return 5; // Lilygo LiPo board
	if (mac == PROGMEM "9C9C1FC9BE94") return 2;
	if (mac == PROGMEM "9C9C1FCB0920") return 2;
	if (mac == PROGMEM "2462ABDDCB34") return 19; // TTGO 1.8 TFT board 
	Serial.printf("MAC %s not found in getLedPin, defaulting to pin 2\n", mac.c_str());
	return 2;
}


class PwmChannel {
	int pin; 
	int channel;
	int pwm = -1;
public:		
	int gradual;
	PwmChannel(int p, int hz = 50, int c = 0, int g = 0) : pin(p), channel(c), gradual(g) {
		ledcSetup(channel, hz, 16);
		ledcAttachPin(pin, channel);
	}
	void setMs(int p) { set(p * 4715 / 1500); };
	void setPercent(int p) { set(p * 65535 / 100); } 
	void setRaw(int p) { 
		while(gradual && pwm > 0 && pwm != p && pwm < 65536 ) { 
			pwm += pwm < p ? 1 : -1;
			ledcWrite(channel, pwm);  
			delayMicroseconds(gradual);
		}
		ledcWrite(channel, p); 
		pwm = p; 
	} 
	void set(int p) {  
		pattern = 0;
		setRaw(p);
	}
	float get() { return (float)pwm / 65535; } 

	int patternPeriod = 0, pattern = 0, patternLen = 0, patternCount = 0;
	float patternBrightness = 1.0, patternSoftness = 0;
	int lastPatIdx = 0, patternFudgeMs = 0;
	void setPattern(int ms, int pat, float bright = 1.0, int count =-1) { 				
		patternPeriod = ms;
		pattern = pat;
		patternLen = 0;
		patternCount = count;
		patternBrightness = bright;
		lastPatIdx = 0;
		while(pat) { 
			patternLen++;
			pat = pat >> 1;
		}
		patternFudgeMs = millis() % (patternPeriod * patternLen);
	}
	void run() { // not reentrant, this can crash if isr routines call setPattern() during loop()->run()
		if (patternPeriod == 0 || pattern == 0)
			return;
		int pat = pattern;
		int pi = ((millis() - patternFudgeMs) % (patternPeriod * patternLen)) / patternPeriod;
		for (int n = 0; n < min(16, pi); n++) { 
			pat= pat >> 1;
		}
		if (pat & 0x1) { 
			float v = abs((int)(millis() % patternPeriod) - patternPeriod/2.0) / (patternPeriod / 2.0 / 100);
			v = min(100.0, max(0.0, 100.0 - v * patternBrightness));
			setRaw(v * 65535 / 100);
		} else { 
			setRaw(0);
		}
		if (pi == 0 && lastPatIdx != 0 && patternCount > 0 && --patternCount == 0) {
			pattern = patternPeriod = patternCount = 0;
			set(0);
		}
		lastPatIdx = pi;
	}
};

#ifndef ESP32
#define PROGMEM
#endif

