cowlove/esp32jimlib/src/jimlib.h
#if 1 // TODO - this could move back to supporting ESP8266
using namespace std;

// TODO: replace "get xxx" hook with making = and white space optional in 
// "set xxx" hook, just use "set xxx" to show command
// TODO: use case insensitive regex matches

class CommandLineInterfaceESP32 { 
	typedef std::function<string(const char *,std::smatch)> callback;
	std::vector<std::pair<std::string, callback>> handlers;
public:

	CommandLineInterfaceESP32() {}

	void on(const char *pat, callback h) { 
		handlers.push_back(std::pair<std::string, callback>(pat, h));
	}
	void on(const char *pat, std::function<void()> f) { 
		on(pat, [f](const char *, std::smatch) { f(); return string(); });
	}
	void on(const char *pat, std::function<void(std::smatch)> f) { 
		on(pat, [f](const char *, std::smatch m) { f(m); return string(); });
	}
	void on(const char *pat, std::function<void(const char *l)> f) { 
		on(pat, [f](const char *l, std::smatch) { f(l); return string(); });
	}
	string process(const char *line) {
		string rval = ""; 
		if (strstr(line, "hooks")) { 
			smatch dummy;
			for(auto i = handlers.begin() + 1; i != handlers.end(); i++) { 
				rval += i->first + " \t " + i->second("", dummy) + "\n";
			}
			return rval;
		}
		for(auto i = handlers.begin(); i != handlers.end(); i++) { 
			std::smatch res;
			std::regex exp((i->first).c_str(), std::regex::icase);
			std::string str = line;
			if (std::regex_match(str, res, exp))  
				rval += i->second(line, res);
		}
		return rval;
	}
	template<typename T>
	void hookRaw(const char *pat, T* v) {
		const char *fmt = formatOf<T>();
		on(pat, [v,fmt](const char *, smatch m) { 
			if (m.size() > 1) 
				sscanf(m.str(1).c_str(), fmt, v);
			return strfmt(fmt, *v);
		});
	}

	template<typename T>
	void hookVar(const char *l, T*p) {
		std::string s = strfmt("set %s[= ]*(.*)", l); // TODO make = optional 
		hookRaw(s.c_str(), p);
		//s = strfmt("get %s", l);
		//hookRaw(s.c_str(), p);	
	}

	template<typename T> const char *formatOf();
};

template<> const char *CommandLineInterfaceESP32::formatOf<float>() { return "%f"; }
template<> const char *CommandLineInterfaceESP32::formatOf<int>() { return "%i"; }
template<> const char *CommandLineInterfaceESP32::formatOf<unsigned int>() { return "%x"; }

template<>
void CommandLineInterfaceESP32::hookRaw<string>(const char *pat, string *v) {
	on(pat, [v](const char *, smatch m) { 
		if (m.size() > 1 && m.str(1).length() > 0)
			*v = m.str(1).c_str();
		return string(*v);
	});
}
template<>
void CommandLineInterfaceESP32::hookRaw<String>(const char *pat, String *v) {
	on(pat, [v](const char *, smatch m) { 
		if (m.size() > 1 && m.str(1).length() > 0)
			*v = m.str(1).c_str();
		return string((*v).c_str());
	});
}


// TODO: need to reimplement this without std::regex so that ESP8266 can still fit in OTA
struct CommandLineInterfaceESP8266 { 
	typedef std::function<string(const char *,std::smatch)> callback;
	void run();
	void begin();
	void on(const char *pat, callback h) {}
	void on(const char *pat, std::function<void()> f) {}
	void on(const char *pat, std::function<void(std::smatch)> f) {}
	void on(const char *pat, std::function<void(const char *l)> f) {}
	string process(const char *line) {
		string s = "TODO: CommandLineInterfaceESP8266 not implemented, ignoring: ";
		s += line;
		//mqtt.pub(s.c_str());
		Serial.print(s.c_str()); 
		return s; 
	}
	template<typename T>
	void hookVar(const char *l, T*p) {}
};

#ifdef ESP32
typedef CommandLineInterfaceESP32 CommandLineInterface;
#else
typedef CommandLineInterfaceESP8266 CommandLineInterface;
#endif

template<typename T> 
class CliVariable {
	T val;
  public:
	CliVariable(CommandLineInterface &c, const char *n) { c.hookVar(n, &val); }
	CliVariable(CommandLineInterface &c, const char *n, T v) : val(v) { c.hookVar(n, &val); }
	operator T&() { return val; }
	T& operator =(T v) { val = v; return val; } 
};

#define CLI_VARIABLE_INT(name,val) CliVariable<int> name = CliVariable<int>(j.cli, #name, val)
#define CLI_VARIABLE_FLOAT(name,val) CliVariable<float> name = CliVariable<float>(j.cli, #name, val)
#define CLI_VARIABLE_STRING(name,val) CliVariable<String> name = CliVariable<String>(j.cli, #name, val)
#define CLI_VARIABLE_HEXINT(name,val) CliVariable<unsigned int> name = CliVariable<unsigned int>(j.cli, #name, val)

class JStuff {		
public:
	bool parseSerial;
	bool beginRan = false;
	std::function<void()> onConn = NULL;
	LineBuffer lb;
	bool debug = false;
	CommandLineInterface cli;
	CliVariable<int> logLevel;
public:
	//PwmChannel led = PwmChannel(getLedPin(), 1024, 10, 2);
	struct {
		void run() {}
		void setPattern(int, int) {}
		void setPercent(int) {}
	} led;
	JStuff(bool ps = true) : parseSerial(ps), logLevel(cli, "logLevel", 1) {
		cli.on("DEBUG", [this]() { 
			jw.debug = debug = true; 
		});
	}
	uint64_t thisRun, lastRun;
	bool forceTicksNow = false; 
	bool hz(float hz) { 
		int us = 1000000.0 / hz;
		return forceTicksNow || (thisRun / us != lastRun / us);
	}
	bool secTick(float sec) { 
		return 
		hz(1.0/sec);
	}
	void forceTicks() { forceTicksNow = true; }

	bool onceFlag = true;
	bool once() { 
		bool rval = onceFlag;
		onceFlag = false;
		return rval;
	}

	bool cliEcho = true;
	JimWiFi jw;
	MQTTClient mqtt = MQTTClient("192.168.68.138", basename_strip_ext(__BASE_FILE__).c_str());
	void run() { 
		if (beginRan == false)
			begin();
		lastRun = thisRun;
		thisRun = micros();
		forceTicksNow = false;

		esp_task_wdt_reset();
		jw.run(); 
		esp_task_wdt_reset();
		mqtt.run(); 
		led.run();
		while(parseSerial == true && Serial.available()) { 
			lb.add(Serial.read(), [this](const char *l) {
				string r = cli.process(l);
				if (cliEcho) 
					Serial.println(r.c_str());
			});
		}
	}
	void begin() { 
		beginRan = true;
		esp_task_wdt_init(15, true);
		esp_task_wdt_add(NULL);

		Serial.begin(115200);
		Serial.printf("\n************************\n\n\n %s " GIT_VERSION " " __DATE__ " " __TIME__ "\n", basename_strip_ext(__BASE_FILE__));
		getLedPin();

		led.setPercent(30);
		jw.onConnect([this](){
			led.setPattern(500, 2);
			if (WiFi.SSID() == "ClemmyNet" || WiFi.SSID() == "FakeWiFi") {
				jw.debug = mqtt.active = true;  
				out("JStuff: forcing debug and mqtt.active due to WiFi network");
 			}
			Serial.printf("Connected to AP '%s' in %dms, IP=%s, channel=%d\n",
				WiFi.SSID().c_str(), millis(), WiFi.localIP().toString().c_str(), WiFi.channel());
			if (onConn != NULL) { 
				onConn();
			}
		});
		mqtt.setCallback([this](String t, String m) {
			string r = cli.process(m.c_str());
			if (cliEcho) 
				mqtt.pub(r.c_str());
		});
	}
	void out(const char *format, ...) { 
		va_list args;
		va_start(args, format);
		char buf[256];
		vsnprintf(buf, sizeof(buf), format, args);
		va_end(args);
		mqtt.pub(buf);
		Serial.println(buf);
		jw.udpDebug(buf);
	}
	void log(int ll, const char *format, ...) { 
		va_list args;
		va_start(args, format);
		char buf[256];
		if (logLevel >= ll) { 
			vsnprintf(buf, sizeof(buf), format, args);
			va_end(args);
			mqtt.pub(buf);
			Serial.println(buf);
			//jw.udpDebug(buf);
		}
	}
	void log(int l, String s) { log(l, s.c_str()); }
	void log(int l, std::string s) { log(l, s.c_str()); }
	void out(String s) { out(s.c_str()); }
	void out(std::string s) { out(s.c_str()); }
};

#define OUT j.out
#define LOG j.log

#endif

class TempSensor { 
	public:
	#define OWNG OneWireNg_CurrentPlatform 
	OWNG *ow = NULL; 
	TempSensor(OWNG *p) : ow(p) {}
	TempSensor(int pin, bool pullup = true) {
		ow = new OWNG(pin, pullup);
	}
	float readTemp(int retries = 5) { 
		for(int i = 0; i < retries; i++) { 
			std::vector<DsTempData> t = readTemps(ow);
			if (t.size() > 0) {
				return t[0].degC;
			}
		}	
		return -999.0;
	}
};

inline void digitalToggle(int pin) { pinMode(pin, OUTPUT); digitalWrite(pin, !digitalRead(pin)); }

// registers SETTEMP, CURRENTTEMP, HIST commands with CLI.  Returns heat on/off
// value from check() function 
class CliTempControl {
public:
	CliVariable<float> setTemp;
	CliVariable<float> currentTemp;
	CliVariable<float> hist;
	CliVariable<int> heat;
	CliVariable<float> minTemp;
	JStuff *j;

	CliTempControl(JStuff *js, float temp, float h) :
		j(js), setTemp(js->cli, "setTemp", temp),
		currentTemp(js->cli, "currentTemp", temp), 
		hist(js->cli, "hist", h),
		heat(js->cli, "heat", 0),
		minTemp(js->cli, "minTemp", 5) {}

	bool check(float temp) { 
		currentTemp = temp;
		if (temp > setTemp) { 
			heat = 0;
		} else if (temp >= minTemp && temp < setTemp - hist) { 
			heat = 1;
		}
		return heat;
	}	
	void pub() { 
		j->out("setTemp: %6.2f currentTemp: %6.2f heat: %d", (float)setTemp, (float)currentTemp, (int)heat);
	}
};



//#endif
#endif //#ifndef INC_JIMLIB_H
